crm/app/views/deals/_form.html.erb

    <%= f.label :account_id %>
    <%= f.collection_select :account_id, Account.order(:name), :id, :name, { include_blank: "—" } %>
---
SELECT `accounts`.* FROM `accounts` ORDER BY `accounts`.`name` ASC

    <%= f.label :contact_id %>
    <%= f.collection_select :contact_id, Contact.order(:last_name), :id, :full_name, { include_blank: "—" } %>
---
SELECT `contacts`.* FROM `contacts` ORDER BY `contacts`.`last_name` ASC