crm/app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO `contacts` (`account_id`, `first_name`, `last_name`, `title`, `email`, `phone`, `created_at`, `updated_at`) VALUES (NULL, 'CHRIS', 'Ho', '', 'chrisissin@gmail.com', '7783213124', '2026-03-04 17:35:31.066222', '2026-03-04 17:35:31.066222')

  def set_contact
    @contact = Contact.find(params[:id])
---
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1