crm/app/controllers/dashboard_controller.rb

  def index
    @accounts_count = Account.count
    @contacts_count = Contact.count
    @deals_count = Deal.count
    @leads_count = Lead.count
    @deals_value = Deal.sum(:value)
---
SELECT COUNT(*) FROM `accounts`
SELECT COUNT(*) FROM `contacts`
SELECT COUNT(*) FROM `deals`
SELECT COUNT(*) FROM `leads`
SELECT SUM(`deals`.`value`) FROM `deals`