crm/app/controllers/deals_controller.rb

  def index
    @deals = Deal.includes(:account, :contact).order(created_at: :desc).page(params[:page]).per(20)
---
SELECT `deals`.* FROM `deals` ORDER BY `deals`.`created_at` DESC LIMIT 20 OFFSET 0

  def create
    @deal = Deal.new(deal_params)
    if @deal.save
---
INSERT INTO `deals` (`account_id`, `contact_id`, `name`, `value`, `stage`, `expected_close_date`, `notes`, `created_at`, `updated_at`) VALUES (NULL, NULL, 'abc', 0.0, 0, '2026-03-12', '', '2026-03-04 17:36:08.244321', '2026-03-04 17:36:08.244321')

  def set_deal
    @deal = Deal.find(params[:id])
---
SELECT `deals`.* FROM `deals` WHERE `deals`.`id` = 1 LIMIT 1