crm/app/views/contacts/_form.html.erb

    <%= f.label :account_id %>
    <%= f.collection_select :account_id, Account.order(:name), :id, :name, { include_blank: "—" } %>
---
SELECT `accounts`.* FROM `accounts` ORDER BY `accounts`.`name` ASC